# Это пример скрипта на Python.

# Нажмите Shift+F10, чтобы выполнить его, или замените своим кодом.
# Нажмите Double Shift, чтобы найти классы, файлы, инструменты, действия и настройки.

def print_hi(name):  # использование
    # Используйте точку останова ниже, чтобы отладить скрипт.
    print(f'Hi, {name}!')  # Нажмите Ctrl+F8, чтобы переключить точку останова.

# Нажмите зеленую кнопку на панели, чтобы запустить скрипт.
if __name__ == '__main__':
    print_hi('PyCharm')

# Смотрите справку по PyCharm на https://www.jetbrains.com/help/pycharm/

